src/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контраагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
<<<<<<< HEAD
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
=======
>>>>>>> 841ea01ceb439cd2cc1b4bb01cc9cdbfcb41b894
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
<<<<<<< HEAD
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
=======
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
>>>>>>> 841ea01ceb439cd2cc1b4bb01cc9cdbfcb41b894
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
<<<<<<< HEAD
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
=======
>>>>>>> 841ea01ceb439cd2cc1b4bb01cc9cdbfcb41b894
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПриходнаяНакладная/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти


#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Формирует запрос инициализации данных документа
// Возвращаемое значение: 
//	Строка
//
Функция ПолучитьТекстЗапросаИнициализироватьДанные()
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Организация КАК Организация,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Склад КАК Склад,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПриходнаяНакладнаяЗапасы.Количество
	|		ИНАЧЕ ПриходнаяНакладнаяЗапасы.Количество * ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ПриходнаяНакладнаяЗапасы.Сумма КАК Сумма,
	|	ПриходнаяНакладнаяЗапасы.Всего КАК Всего,
	|	ПриходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Дата КАК Период
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
КонецФункции


// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры СтруктураДополнительныеСвойства.
//
// Параметры:
//  - ДокументСсылкаПриходнаяНакладная - ДокументаСсылка.ПриходнаяНакладная - ссылка на документ приходная накладная
//  - СтруктураДополнительныеСвойства	- Структура - дополнительные свойства документа
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Организация КАК Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Склад КАК Склад,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Организация,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Склад";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
КонецПроцедуры


// Инициализирует таблицы значений, содержащие данные таб. частей документа
//
// Параметры:
//  ДокументСсылкаПриходнаяНакладная  - ДокументСсылка.ПриходнаяНакладная - ссылка на документ
//  СтруктураДополнительныеСвойства  - Структура - дополнительные свойства документа
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = ПолучитьТекстЗапросаИнициализироватьДанные();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПриходнаяНакладная);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти
